#Напишете конзолна програма, която чете от потребителя:• Възраст и пол на човек• Принтира обръщение, според възрастта на дадения
#човек:- “Mr.” – мъж (пол “m”) на 16 или повече години- “Master” – момче (пол “m”) под 16 години
#- “Ms.” – жена (пол 'f‘) на 16 или повече години
#- “Miss.” – момиче (пол 'f‘) под 16 години
#Направете проверка за пола, след което и проверка зa годините.В тялото на проверките за възраст принтирайте желанотообръщение:

def main():
    # Въвеждане на възраст и пол от потребителя
    age = int(input("Въведете възраст: "))
    gender = input("Въведете пол (m/f): ")

    # Проверка за пола и възрастта
    if gender.lower() == 'm':
        if age >= 16:
            print("Mr.")
        else:
            print("Master")
    elif gender.lower() == 'f':
        if age >= 16:
            print("Ms.")
        else:
            print("Miss")
    else:
        print("Грешен вход за пол. Моля, въведете 'm' за мъж или 'f' за жена.")

#if __name__ == "__main__":
    # Извикване на основната функция
    main()
