# 4. Използване на псевдоними (aliases):
# Задача: Импортирайте библиотеката datetime като dt и
# използвайте я, за да отпечатате текущата дата и час.

# Импорт на библиотеката datetime с псевдоним dt
import datetime as dt

# Използване на библиотеката за получаване на текущата дата и час
current_datetime = dt.datetime.now()

# Отпечатване на текущата дата и час
print("Текуща дата и час:", current_datetime)
